app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "What Happened! "], ["room_number", 201], ["created_at", "2021-01-18 00:15:38.482504"], ["updated_at", "2021-01-18 00:15:38.482504"]]
---
    def create
        @school_class = SchoolClass.new
        @school_class.title = params[:school_class][:title]
        @school_class.room_number = params[:school_class][:room_number]
        @school_class.save