app/controllers/students_controller.rb

    def update
        @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Kentwood"], ["updated_at", "2021-01-17 22:46:57.147689"], ["id", 6]]